//- є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)


let arr=[2,17,13,6,22,31,45,66,100,-18];
//let i=0;
//while (i<arr.length) {
//console.log(arr[i]);
//i++}


let a=0;
while (a<arr.length) {
    if (a % 2 !== 0) {
        console.log(arr[a]);
    }
    a++
}


//for (let l = 0; l < arr.length; l++) {
  //  if (l%2===0) {
    //    console.log(arr[l]);
    //}
//}

//for (let i = 0; i < arr.length; i++) {
  // if (arr[i]%3===0) {
    //   arr[i]='okten';
      // console.log(arr[i]);
   //}

//}

for (let n = arr.length; n >=0; n--) {
    console.log(arr[n]);
}
for (let i = arr.length; i>=0; i--) {
    if (i%2===0) {
        console.log(arr[i]);
    }

}